Tekla Open API Reference for Tekla Structures 2025
PropertyElement Properties
The PropertyElement type exposes the following members.
Properties
Name | Description
Font
 The font of the property.
Name
 The property name.
PropertyType
 The type of the property element.
Value
 The current value of the property.
Top
See Also
Reference
PropertyElement Class
Tekla.Structures.Drawing Namespace